<a href="https://colab.research.google.com/github/seansothey/NoSQL-BigData/blob/master/Problem3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Transform the dataset from the wide to the long format. i.e. the new table should have three columns: day, city, and temperature.

##Given Code

In [2]:
import numpy as np
import pandas as pd
np.random.seed(seed=0)

Cities = ['New York City','Philadelphia']
Temperatures_Data = []
Day = 1
for i in range(100):    
    Daily_Temperatures = [Day]
    for City in Cities:
        Temperature = round(np.random.normal(loc=50,scale=12),2)
        Daily_Temperatures.append(Temperature)
    Temperatures_Data.append(Daily_Temperatures)
    Day += 1

df_columns = ['Day']
for City in Cities:
    df_columns.append(City)

Temperatures_Wide_df = pd.DataFrame(data=Temperatures_Data,columns=df_columns)
Temperatures_Wide_df.iloc[0:10]

   Day  New York City  Philadelphia
0    1          71.17         54.80
1    2          61.74         76.89
2    3          72.41         38.27
3    4          61.40         48.18
4    5          48.76         54.93
5    6          51.73         67.45
6    7          59.13         51.46
7    8          55.33         54.00
8    9          67.93         47.54
9   10          53.76         39.75

##Solution

In [9]:
result = Temperatures_Wide_df.melt(id_vars=["Day"], 
        var_name="City", 
        value_name="Temperature")
result

     Day           City  Temperature
0      1  New York City        71.17
1      2  New York City        61.74
2      3  New York City        72.41
3      4  New York City        61.40
4      5  New York City        48.76
..   ...            ...          ...
195   96   Philadelphia        53.20
196   97   Philadelphia        35.98
197   98   Philadelphia        47.94
198   99   Philadelphia        59.88
199  100   Philadelphia        66.04

[200 rows x 3 columns]